app/controllers/cohort_controller.rb

def index
	@cohorts = Cohort.all()
---
SELECT "cohorts".* FROM "cohorts"