app/controllers/cohort_controller.rb

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students" WHERE "students"."cohort_id" = $1  [["cohort_id", 1]]
---
def show
	@klass = Cohort.find(params[:id])
	@present = []
	@absent = []
	@students = 'x,'
	@cohort_id = @klass.id
	@cohort = @klass.students
	@averageComp = totalAverageComp(@cohort)
	@cohort.each do |stu|

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 1]]
---
def data
    @cohort = Cohort.find(params[:id])

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 1]]
---
def attendance
	klass = Cohort.find(params[:id])

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 1]]
---
def homework
	klass = Cohort.find(params[:id])